<a href="https://colab.research.google.com/github/Sairam-04/Feature-Engineering/blob/main/Handling_Missing_Values_in_titanic_dataset.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>


Different types of Missing Data:
* Missing Completely at Random(MCAR):<br>
&nbsp;&nbsp;&nbsp;When Data is missing in MCAR there will be no relationship between missing and other values in the dataset

* Missing Data not at Random(MNAR):<br>
&nbsp;&nbsp;&nbsp; When Data is missing in MCAR there will be relationship between missing values and other values in dataset

* Missing at Random(MAR):<br>
&emsp;Missing of values in dataset at random

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df = pd.read_csv('titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Gender           0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
# 1.MCAR
df['Embarked'].head()

0    S
1    C
2    S
3    S
4    S
Name: Embarked, dtype: object

Embarked is example of MCAR because there is no relation between Embarked and other variables.
Coming to Age and Cabin there is relationship so they doesn't come under MCAR

In [ ]:
df[df['Embarked'].isnull()]

     PassengerId  Survived  Pclass  ...  Fare Cabin  Embarked
61            62         1       1  ...  80.0   B28       NaN
829          830         1       1  ...  80.0   B28       NaN

[2 rows x 12 columns]

In [ ]:
# 2.MNAR
# converting NAN values to 1's or 0's
df['cabin_null'] = np.where(df['Cabin'].isnull(),1,0)

# % of null values
print('Precentage of Null values in Cabin column '+str(df['cabin_null'].mean()))

Precentage of Null values in Cabin column 0.7710437710437711

In [ ]:
df.head()

   PassengerId  Survived  Pclass  ... Cabin Embarked  cabin_null
0            1         0       3  ...   NaN        S           1
1            2         1       1  ...   C85        C           0
2            3         1       3  ...   NaN        S           1
3            4         1       1  ...  C123        S           0
4            5         0       3  ...   NaN        S           1

[5 rows x 13 columns]

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Gender', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'cabin_null'],
      dtype='object')

In [ ]:
# Finding the percentage of survived by grouping Cabin
df.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64